Revit 2026 API

# LayoutRuleFixedNumber Class

---

This class indicate the layout rule of a Beam System is Fixed-Number.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBLayoutRule Autodesk.Revit.DBLayoutRuleFixedNumber

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class LayoutRuleFixedNumber : LayoutRule
```
```vb
Public Class LayoutRuleFixedNumber
	Inherits LayoutRule
```
```cpp
public ref class LayoutRuleFixedNumber : public LayoutRule
```
```fsharp
type LayoutRuleFixedNumber =
    class
        inherit LayoutRule
    end
```

The LayoutRuleFixedNumber type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | LayoutRuleFixedNumber | Constructor of LayoutRuleFixedNumber. |

|  | Name | Description |
| --- | --- | --- |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |
|  | NumberOfLines | Get or set the number of the beams in a beam system. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

To use this type of LayoutRule, only the number of the beams must be set.

#### Reference

Autodesk.Revit.DB Namespace